{
	"Eureka": {
	"title": "Eureka",
	"difficulty": "Hard",
	"date": "August 30, 2025",
	"description": "Eureka is a hard-difficulty Linux box featuring heap dump analysis, Spring Eureka service SSRF exploitation, command injection in log processing script, and cronjob manipulation for privilege escalation."
  },
	"TheFrizz": {
	"title": "TheFrizz",
  "difficulty": "Medium",
	"date": "August 23, 2025",
	"description": "TheFrizz is a medium-difficulty Windows box focusing on exploitation of Gibbon LMS, different ways of gaining access to the machine, deleted archives recovery and GPO abuse for system command execution."
  },
	"Nocturnal": {
	"title": "Nocturnal",
	"difficulty": "Easy",
	"date": "August 16, 2025",
	"description": "Nocturnal is an easy-difficulty Linux box involving exploitation of IDOR and command injection vulnerabilities in a file upload application, followed by privilege escalation through CVE-2023-46818 in ISPConfig."
  },
	"University": {
	"title": "University",
	"difficulty": "Insane",
	"date": "August 9, 2025",
	"description": "University is an insane-difficulty Windows machine featuring ReportLab CVE exploitation for initial access, certificate forgery using compromised CA files, lateral movement through network pivoting, malicious lecture uploads, and much more."
  },
	"Code": {
	"title": "Code",
	"difficulty": "Easy",
	"date": "August 2, 2025",
	"description": "Code is an easy-difficulty Linux box focusing on an online Python code editor, SQLAlchemy database extraction, and privilege escalation through a vulnerable backup script with filter bypass."
  },
	"Cypher": {
	"title": "Cypher",
	"difficulty": "Medium",
	"date": "July 25, 2025",
	"description": "Cypher is a medium-difficulty Linux box featuring cypher injection, OS command execution via Neo4j custom procedures, and privilege escalation through a custom bbot module."
  },
	"Scepter": {
  "title": "Scepter",
  "difficulty": "Hard",
  "date": "July 19, 2025",
  "description": "Scepter is a hard-difficulty Windows box involving enumeration of an NFS share, certificate usage, attribute modification, and abusing ESC14/ESC9 for account takeover."
  },
	"Dog": {
	"title": "Dog",
	"difficulty": "Easy",
	"date": "July 12, 2025",
	"description": "Dog is an easy-difficulty Linux box focusing on source code analysis, Backdrop CMS exploitation via arbitrary module installation and RCE, password reuse, and root command execution via bee for root access."
  },
	"Cat": {
	"title": "Cat",
	"difficulty": "Medium",
	"date": "July 5, 2025",
	"description": "Cat is a medium-difficulty Linux box focusing on Cross-Site Scripting, git repository dumping, SQL injection, and privilege escalation via XSS-based credential exfiltration from a vulnerable Gitea instance."
  },
	"Haze": {
	"title": "Haze",
	"difficulty": "Hard",
	"date": "June 28, 2025",
	"description": "Haze is a hard-difficulty Windows box involving Splunk exploitation, chaining multiple AD permission abuse methods, and SeImpersonatePrivilege abuse via SweetPotato for SYSTEM access."
  },
	"Titanic": {
	"title": "Titanic",
	"difficulty": "Easy",
	"date": "June 21, 2025",
	"description": "Titanic is an easy-difficulty Linux box focusing on LFI, Gitea database extraction, hash transformation and RCE via ImageMagick CVE-2024-41817."
  },
	"Infiltrator": {
	"title": "Infiltrator",
	"difficulty": "Insane",
	"date": "June 14, 2025",
	"description": "Infiltrator is an insane-dificulty Windows machine featuring many AD escalation methods, Output Messenger exploitation, chat log reading via API, reverse shell via calendar functionality and much more."
  },
	"Backfire": {
	"title": "Backfire",
	"difficulty": "Medium",
	"date": "June 7, 2025",
	"description": "Backfire is a medium-difficulty Linux box focusing on C2 server exploitation(Havoc, HardHat), ssh key injection for persistence and iptables comment abuse for root."
  },
  "Checker": {
	"title": "Checker",
	"difficulty": "Hard",
	"date": "May 31, 2025",
	"description": "Checker is a hard-difficulty Linux box involving Teampass SQL injection for credential extraction, Bookstack SSRF-LFI, binary reverse engineering, and TOCTOU shared memory poisoning for privilege escalation."
  },
  "Reddish": {
	"title": "Reddish",
	"difficulty": "Insane",
	"date": "May 29, 2025",
	"description": "Reddish is an insane-difficulty Linux box with an emphasis on tunneling and manual enumeration without standard tools, featuring Node-RED exploitation, Redis abuse, rsync wildcard injection and cronjob manipulation."
  },
  "EscapeTwo": {
	"title": "EscapeTwo",
	"difficulty": "Easy",
	"date": "May 24, 2025",
	"description": "EscapeTwo is an easy-difficulty Windows box featuring XLSX file extraction, MSSQL command execution via xp_cmdshell, cert template modification and an ESC4-ESC1 certificate attack."
  },
  "Heal": {
	"title": "Heal",
	"difficulty": "Medium",
	"date": "May 17, 2025",
	"description": "Heal is a medium-difficulty Linux box featuring subdomain enumeration, PDF export LFI vulnerability, credential extraction, LimeSurvey RCE exploitation, and privilege escalation via Consul service vulnerability."
  },
  "UnderPass": {
	"title": "UnderPass",
	"difficulty": "Easy",
	"date": "May 10, 2025",
	"description": " UnderPass is an easy-difficulty Linux box featuring UDP enumeration, daloradius service discovery, hash cracking, and privilege escalation via mosh-server sudo permissions."
  },
  "BigBang": {
	"title": "BigBang",
	"difficulty": "Hard",
	"date": "May 3, 2025",
	"description": "BigBang is a hard-difficulty Linux box involving WordPress plugin exploitation, Docker-based MySQL access, Grafana hash cracking, and an APK-based command injection."
  },
  "Vintage": {
	"title": "Vintage",
	"difficulty": "Hard",
	"date": "April 26, 2025",
	"description": "Vintage is a hard-difficulty Windows box focused on permission abuse, GMSA secrets, DPAPI decryption, and delegation-based privilege escalation."
  },
  "Administrator": {
	"title": "Administrator",
	"difficulty": "Medium",
	"date": "April 19, 2025",
	"description": "Administrator is a medium-difficulty Windows box featuring Active Directory exploitation through a chain of user permissions, targeted kerberoasts and DCsync."
  },
  "LinkVortex": {
	"title": "LinkVortex",
	"difficulty": "Easy",
	"date": "April 12, 2025",
	"description": "LinkVortex is an easy-difficulty Linux box featuring fuzzing, exposed Git repos, Ghost CMS exploitation, and creative symlink-based privilege escalation."
  },
  "Ghost": {
	"title": "Ghost",
	"difficulty": "Insane",
	"date": "April 5, 2025",
	"description": "Ghost is an insane-difficulty Windows box featuring LDAP authentication bypass, LFI, DNS poisoning, Kerberos exploitation, Golden SAML attack, linked SQL server abuse, and bidirectional trust exploitation."
  },
  "Cicada": {
	"title": "Cicada",
	"difficulty": "Easy",
	"date": "February 15, 2025",
	"description": "Cicada is an easy-difficulty Windows box that focuses on SMB enumeration, password spraying and privilege escalation via SeBackupPrivilege."
  },
  "Chemistry": {
	"title": "Chemistry",
	"difficulty": "Easy",
	"date": "March 8, 2025",
	"description": "Chemistry is an easy-difficulty Linux box involving CIF file exploitation, weak password hashing and outdated service vulnerabilities."
  },
  "Alert": {
	"title": "Alert",
	"difficulty": "Easy",
	"date": "March 22, 2025",
	"description": "Alert is an easy-difficulty Linux box involving Markdown file upload exploitation, XSS-based LFI, credential cracking, and configuration file poisoning for privilege escalation."
  },
  "Instant": {
	"title": "Instant",
	"difficulty": "Medium",
	"date": "March 1, 2025",
	"description": "Instant is a medium-difficulty Linux box that challenges users with Android app reverse engineering, API exploitation, and credential decryption."
  },
  "Certified": {
	"title": "Certified",
	"difficulty": "Medium",
	"date": "March 15, 2025",
	"description": "Certified is a medium-difficulty Windows box focusing on AD enumeration, shadow credential abuse, and certificate template exploitation."
  },
  "Yummy": {
	"title": "Yummy",
	"difficulty": "Hard",
	"date": "February 22, 2025",
	"description": "Yummy is a hard-difficulty Linux box that challenges users with JWT forgery, SQL injection, misconfigured file privileges, and version control exploitation."
  },
  "BlockBlock": {
  "title": "BlockBlock",
  "difficulty": "Hard",
  "date": "March 29, 2025",
  "description": "BlockBlock is a hard-difficulty Linux box involving XSS-based token theft, JSON-RPC exploitation, blockchain transaction analysis, Forge abuse for privesc and Pacman package manipulation."
  },
  "Certificate": {
	"title": "Certificate",
	"difficulty": "Hard",
	"date": "Active machine",
	"description": ""
  },
  "RustyKey": {
	"title": "RustyKey",
	"difficulty": "Hard",
	"date": "Active machine",
	"description": ""
  },
  "Mirage": {
	"title": "Mirage",
	"difficulty": "Hard",
	"date": "Active machine",
	"description": ""
  },
  "Guardian": {
	"title": "Guardian",
	"difficulty": "Hard",
	"date": "Active machine",
	"description": ""
  },
  "Environment": {
	"title": "Environment",
	"difficulty": "Medium",
	"date": "Active machine",
	"description": ""
  },
  "Puppy": {
	"title": "Puppy",
	"difficulty": "Medium",
	"date": "Active machine",
	"description": ""
  },
  "TombWatcher": {
	"title": "TombWatcher",
	"difficulty": "Medium",
	"date": "Active machine",
	"description": ""
  },
  "Voleur": {
	"title": "Voleur",
	"difficulty": "Medium",
	"date": "Active machine",
	"description": ""
  },
  "Era": {
	"title": "Era",
	"difficulty": "Medium",
	"date": "Active machine",
	"description": ""
  },
  "Previous": {
	"title": "Previous",
	"difficulty": "Medium",
	"date": "Active machine",
	"description": ""
  },
  "Planning": {
	"title": "Planning",
	"difficulty": "Easy",
	"date": "Active machine",
	"description": ""
  },
  "Fluffy": {
	"title": "Fluffy",
	"difficulty": "Easy",
	"date": "Active machine",
	"description": ""
  },
  "Artificial": {
	"title": "Artificial",
	"difficulty": "Easy",
	"date": "Active machine",
	"description": ""
  },
  "Outbound": {
	"title": "Outbound",
	"difficulty": "Easy",
	"date": "Active machine",
	"description": ""
  },
  "Editor": {
	"title": "Editor",
	"difficulty": "Easy",
	"date": "Active machine",
	"description": ""
  },
  "CodeTwo": {
	"title": "CodeTwo",
	"difficulty": "Easy",
	"date": "Active machine",
	"description": ""
  },
  "DarkCorp": {
	"title": "DarkCorp",
	"difficulty": "Insane",
	"date": "Active machine",
	"description": ""
  },
  "WhiteRabbit": {
	"title": "WhiteRabbit",
	"difficulty": "Insane",
	"date": "Active machine",
	"description": ""
  },
  "Sorcery": {
	"title": "Sorcery",
	"difficulty": "Insane",
	"date": "Active machine",
	"description": ""
  },
  "Cobblestone": {
	"title": "Cobblestone",
	"difficulty": "Insane",
	"date": "Active machine",
	"description": ""
  }
}