{
	"CafePoisoning": {
	"title": "CafePoisoning",
	"difficulty": "Medium",
	"date": "February 5, 2026",
	"description": "CafePoisoning is a Medium-difficulty DFIR sherlock featuring ARP poisoning/MITM attacks on public Wi-Fi, DNS spoofing, reverse engineering malware, C2 communication analysis, PowerShell AV evasion, and screensaver-based registry persistence mechanisms."
  },
	"SalineBreeze-2": {
	"title": "SalineBreeze-2",
	"difficulty": "Easy",
	"date": "January 29, 2026",
	"description": "No writeup"
  },
	"Caught": {
	"title": "Caught",
	"difficulty": "Hard",
	"date": "January 22, 2026",
	"description": "Caught is a Hard-difficulty DFIR sherlock featuring insider threat via AD exploitation, multi-stage JScript deserialization attacks, Sliver C2, AD privilege escalation chains (GenericAll→GenericWrite→GPO abuse), attacker artifacts analysis, and WMI event consumer persistence."
  },
	"SalineBreeze-1": {
	"title": "SalineBreeze-1",
	"difficulty": "VEasy",
	"date": "January 15, 2026",
	"description": "SalineBreeze-1 is a very easy-difficulty threat intelligence sherlock involving OSINT research on the Salt Typhoon APT group, utilizing MITRE ATT&CK framework to map TTPs, analyzing malware like GhostSpider and Demodex rootkit, and investigating CVEs used in telecom attacks."
  },
	"Malevolent ModMaker": {
	"title": "Malevolent ModMaker",
	"difficulty": "Medium",
	"date": "January 8, 2026",
	"description": "Malevolent ModMaker is a medium-difficulty Malware Analysis sherlock focusing on reverse engineering a Go-based ransomware dropper, analyzing Discord C2 webhooks, examining AES-GCM encryption implementation, and decrypting victim files."
  },
	"GateKeeper": {
	"title": "GateKeeper",
	"difficulty": "Hard",
	"date": "January 1, 2026",
	"description": "GateKeeper is a hard-difficulty DFIR sherlock featuring analysis of a compromised Mac system, investigating Gatekeeper bypass via CVE-2022-22616, privilege escalation through CVE-2019-8513, parsing unified logs and Safari artifacts, and mapping attacker TTPs."
  },
	"Interceptor": {
	"title": "Interceptor",
	"difficulty": "Easy",
	"date": "December 25, 2025",
	"description": "Interceptor is an easy-difficulty SOC sherlock involving PCAP analysis of an SSLoad malware infection, tracing malicious MSI downloads via WebDAV, decrypting RC4-encrypted C2 communications, and identifying compromised system details."
  },
    "WhyFind": {
	"title": "WhyFind",
	"difficulty": "Easy",
	"date": "December 25, 2025",
	"description": "WhyFind is an easy-difficulty DFIR sherlock focusing on analysis of a KAPE output, Windows registry examination, network profile analysis, MFT journal parsing, browser artifact extraction, and VM creation investigation."
  },
	"Cuidado": {
	"title": "Cuidado",
	"difficulty": "Easy",
	"date": "December 11, 2025",
	"description": "Cuidado is an easy-difficulty SOC sherlock featuring analysis of a cryptocurrency miner infection using a PCAP file, tracing malicious downloads, dissecting bash droppers, unpacking UPX-compressed payloads, and identifying attacker TTPs"
  },
	"ElectricBreeze-2": {
	"title": "ElectricBreeze-2",
	"difficulty": "Easy",
	"date": "November 27, 2025",
	"description": "ElectricBreeze-2 is an easy-difficulty Malware Analysis sherlock involving static analysis of a Volt Typhoon JAR malware sample, examining web shell functionality, encryption methods, and credential theft mechanisms."
  },
	"ReachKart": {
	"title": "ReachKart",
	"difficulty": "Medium",
	"date": "November 13, 2025",
	"description": "ReackKart is a medium-difficulty DFIR sherlock focusing on blockchain technology incident response, featuring LFI exploitation analysis, network packet analysis, database forensics, and cryptocurrency theft tracking."
  },
	"Zenith": {
	"title": "Zenith",
	"difficulty": "Easy",
	"date": "November 6, 2025",
	"description": "Zenith is an easy-difficulty DFIR sherlock featuring malicious email analysis, embedded malware extraction, reverse engineering persistence mechanisms, and tracking privilege escalation through Windows event logs."
  },
	"Payload": {
	"title": "Payload",
	"difficulty": "Easy",
	"date": "October 30, 2025",
	"description": "Payload is an easy-difficulty Malware Analysis sherlock involving analysis of a Windows executable compiled with MingW, and dynamic analysis of this malware with x64WinDbg to skip the complex decryption procedure and uncover the payload."
  },
	"Streamer": {
	"title": "Streamer",
	"difficulty": "Hard",
	"date": "October 23, 2025",
	"description": "Streamer is a hard-difficulty DFIR sherlock focusing on Internet Explorer WebCache analysis, Amcache.hve file parsing, Using Windows Event Logs to uncover traffic, Using MFTECmd to recover file contents, and parsing ShellBags to discover user activity."
  },
	"Trojan": {
	"title": "Trojan",
	"difficulty": "Easy",
	"date": "October 16, 2025",
	"description": "Trojan is an easy-difficulty DFIR sherlock featuring artifact analysis, prefetch file parsing, memory dump investigation with volatility, extracting malware from a PCAP file, and using public sources to learn more about the malware."
  },
	"APTNightmare-2": {
	"title": "APTNightmare-2",
	"difficulty": "Hard",
	"date": "October 9, 2025",
	"description": "APTNightmare-2 is a hard-difficulty DFIR sherlock involving analysis of a memory dump with volatility2, importing a profile, finding hidden processes, discovering a rootkit, and reverse engineering the malware to uncover its functionality."
  },
	"CrewCrow": {
	"title": "CrewCrow",
	"difficulty": "Medium",
	"date": "September 25, 2025",
	"description": "CrewCrow is a medium-difficulty DFIR sherlock focusing on extracting Zoom artifacts, decrypting DPAPI credentials, cracking NTLM hashes, decrypting Zoom encrypted databases to recover meeting IDs/passwords, and uncovering a planned operation’s origin."
  },
	"RomCom": {
	"title": "RomCom",
	"difficulty": "VEasy",
	"date": "September 18, 2025",
	"description": "RomCom is a very easy-difficulty DFIR sherlock featuring CVE-2025-8088 abuse examination, UsnJournal and $MFT parsing, and pinpointing the timestamps of crucial events."
  },
	"ElectricBreeze-1": {
	"title": "ElectricBreeze-1",
	"difficulty": "VEasy",
	"date": "September 11, 2025",
	"description": "ElectricBreeze-1 is a very easy-difficulty TI sherlock involving usage of the MITRE ATT&CK framework to learn more about the malicious group, and reading publicly available articles to gather crucial information."
  },
	"DroidPhish": {
	"title": "DroidPhish",
	"difficulty": "Easy",
	"date": "September 4, 2025",
	"description": "DroidPhish is an easy-difficulty DFIR sherlock focusing on analysis of a phishing incident, discovering a suspicious email message, and investigating a malicious APK file. "
  },
	"Unsupervised": {
	"title": "Unsupervised",
	"difficulty": "Medium",
	"date": "August 28, 2025",
	"description": "Unsupervised is a medium-difficulty DFIR sherlock featuring windows registry exploration, enumeration of registered USB drives, investigating jump lists for copied files and analyzing thumbcache databases."
  },
	"Anpu": {
	"title": "Anpu",
	"difficulty": "Medium",
	"date": "August 14, 2025",
	"description": "Anpu is a medium-difficulty DFIR sherlock involving analysis of a multi-purpose trojan distributed via Discord, examining overlay attacks and ransomware capabilities through Android forensics and APK reverse engineering."
  },
	"PercyPay": {
	"title": "PercyPay",
	"difficulty": "Easy",
	"date": "August 7, 2025",
	"description": "PercyPay is an easy-difficulty Cloud sherlock focusing on log analysis of an attack chain involving credential exposure, privilege escalation through Lambda functions, security evasion, and customer data exfiltration."
  },
	"TeamWork": {
	"title": "TeamWork",
	"difficulty": "Easy",
	"date": "July 31, 2025",
	"description": "TeamWork is an easy-difficulty TI sherlock featuring analysis of a social engineering campaign, investigating fake NFT gaming infrastructure, tracing malicious files through archived websites, and mapping the TA's tactics."
  },
	"ReliableThreat": {
	"title": "ReliableThreat",
	"difficulty": "Medium",
	"date": "July 24, 2025",
	"description": "ReliableThreat is a medium-difficulty DFIR sherlock focusing on tracing a malicious VSCode extension infection chain, analyzing the malware files, pinpointing the attacker's actions and describing the techniques they used."
  },
	"Origins": {
	"title": "Origins",
	"difficulty": "VEasy",
	"date": "July 17, 2025",
	"description": "Origins is a very easy-difficulty DFIR sherlock involving analysis of a PCAP file, discovering a successful bruteforce attack targeting FTP, and assessing the potential impact of the attack,"
  },
	"Kuber": {
	"title": "Kuber",
	"difficulty": "Easy",
	"date": "July 3, 2025",
	"description": "Kuber is an easy-difficulty DFIR sherlock featuring Kubernetes cluster examination, and finding a malicious pod."
},
	"Loggy": {
	"title": "Loggy",
	"difficulty": "Easy",
	"date": "June 28, 2025",
	"description": "Loggy is an easy-difficulty malware analysis sherlock focusing on reverse engineering of a keylogger written in Golang, analyzing its data exfiltration mechanisms and extracting compromised credentials."
  },
  "Psittaciformes": {
	"title": "Psittaciformes",
	"difficulty": "Easy",
	"date": "May 29, 2025",
	"description": "Psittaciformes is an easy-difficulty DFIR sherlock involving log analysis, bash history forensics, git repository analysis and code review."
  },
	"Compromised": {
	"title": "Compromised",
	"difficulty": "Easy",
	"date": "May 15, 2025",
	"description": "Compromised is an easy-difficulty SOC sherlock involving PCAP analysis of a Pikabot malware infection, focusing on initial access vectors and C2 infrastructure identification."
  },
   "PhishNet": {
	"title": "PhishNet",
	"difficulty": "VEasy",
	"date": "Active sherlock",
	"description": ""
  },
    "Whisper": {
	"title": "Whisper",
	"difficulty": "Easy",
	"date": "Active sherlock",
	"description": ""
  },
    "Packet Puzzle": {
	"title": "Packet Puzzle",
	"difficulty": "Easy",
	"date": "Active sherlock",
	"description": ""
  },
    "HookFlare": {
	"title": "HookFlare",
	"difficulty": "Medium",
	"date": "Active sherlock",
	"description": ""
  },
    "WorkFromHome": {
	"title": "WorkFromHome",
	"difficulty": "Medium",
	"date": "Active sherlock",
	"description": ""
  },
    "Easy Money": {
	"title": "Easy Money",
	"difficulty": "Medium",
	"date": "Active sherlock",
	"description": ""
  },
    "SneakyKeys": {
	"title": "SneakyKeys",
	"difficulty": "Medium",
	"date": "Active sherlock",
	"description": ""
  },
    "Lupin": {
	"title": "Lupin",
	"difficulty": "Medium",
	"date": "Active sherlock",
	"description": ""
  },
    "Ruse": {
	"title": "Ruse",
	"difficulty": "Hard",
	"date": "Active sherlock",
	"description": ""
  }
}