{
	"PercyPay": {
	"title": "PercyPay",
	"difficulty": "Easy",
	"date": "August 7, 2025",
	"description": "PercyPay is an easy-difficulty Cloud sherlock focusing on log analysis of an attack chain involving credential exposure, privilege escalation through Lambda functions, security evasion, and customer data exfiltration."
  },
	"TeamWork": {
	"title": "TeamWork",
	"difficulty": "Easy",
	"date": "July 31, 2025",
	"description": "TeamWork is an easy-difficulty TI sherlock featuring analysis of a social engineering campaign, investigating fake NFT gaming infrastructure, tracing malicious files through archived websites, and mapping the TA's tactics."
  },
	"ReliableThreat": {
	"title": "ReliableThreat",
	"difficulty": "Medium",
	"date": "July 24, 2025",
	"description": "ReliableThreat is a medium-difficulty DFIR sherlock focusing on tracing a malicious VSCode extension infection chain, analyzing the malware files, pinpointing the attacker's actions and describing the techniques they used."
  },
	"Origins": {
	"title": "Origins",
	"difficulty": "VEasy",
	"date": "July 17, 2025",
	"description": "Origins is a very easy-difficulty DFIR sherlock involving analysis of a PCAP file, discovering a successful bruteforce attack targeting FTP, and assessing the potential impact of the attack,"
  },
	"Kuber": {
	"title": "Kuber",
	"difficulty": "Easy",
	"date": "July 3, 2025",
	"description": "Kuber is an easy-difficulty DFIR sherlock featuring Kubernetes cluster examination, and finding a malicious pod."
},
	"Loggy": {
	"title": "Loggy",
	"difficulty": "Easy",
	"date": "June 28, 2025",
	"description": "Loggy is an easy-difficulty malware analysis sherlock focusing on reverse engineering of a keylogger written in Golang, analyzing its data exfiltration mechanisms and extracting compromised credentials."
  },
  "Psittaciformes": {
	"title": "Psittaciformes",
	"difficulty": "Easy",
	"date": "May 29, 2025",
	"description": "Psittaciformes is an easy-difficulty DFIR sherlock involving log analysis, bash history forensics, git repository analysis and code review."
  },
	"Compromised": {
	"title": "Compromised",
	"difficulty": "Easy",
	"date": "May 15, 2025",
	"description": "Compromised is an easy-difficulty SOC sherlock involving PCAP analysis of a Pikabot malware infection, focusing on initial access vectors and C2 infrastructure identification."
  },
  "Zenith": {
	"title": "Zenith",
	"difficulty": "Easy",
	"date": "Active sherlock",
	"description": ""
  },
  "Cuidado": {
	"title": "Cuidado",
	"difficulty": "Easy",
	"date": "Active sherlock",
	"description": ""
  },
  "Interceptor": {
	"title": "Interceptor",
	"difficulty": "Easy",
	"date": "Active sherlock",
	"description": ""
  },
	"Streamer": {
	"title": "Streamer",
	"difficulty": "Hard",
	"date": "Active sherlock",
	"description": ""
  },
  "GateKeeper": {
	"title": "GateKeeper",
	"difficulty": "Hard",
	"date": "Active sherlock",
	"description": ""
  }
}